let DCSSnippets = {
  "Выбор": {
    "prefix": "Выбор",
    "body": "Выбор\n\tКогда ${1:Условие}\n\t\tТогда $2\n\tИначе $0\nКонец",
    "description": "Выбор"
  },
  "НачалоПериода": {
    "prefix": "НачалоПериода",
    "body": "НачалоПериода(\"$1\", ${2|\"Минута\",\"Час\",\"День\",\"Неделя\",\"Декада\",\"Месяц\",\"Квартал\",\"Полугодие\",\"Год\"|})",
    "description": "НачалоПериода"
  },
  "КонецПериода": {
    "prefix": "КонецПериода",
    "body": "КонецПериода(\"$1\", ${2|\"Минута\",\"Час\",\"День\",\"Неделя\",\"Декада\",\"Месяц\",\"Квартал\",\"Полугодие\",\"Год\"|})",
    "description": "КонецПериода"
  },
  "Вычислить": {
    "prefix": "Вычислить",
    "body": "Вычислить(\"$1\", ${2|\"\",\"ОбщийИтог\"|}, ${3|\"\",\"ОбщийИтог\",\"Группировка\"|})",
    "description": "Вычислить"
  },
  "ВычислитьВыражение": {
    "prefix": "ВычислитьВыражение",
    "body": "ВычислитьВыражение(\"$1\", ${2|\"\",\"ОбщийИтог\"|}, ${3|\"\",\"ОбщийИтог\",\"Группировка\",\"ГруппировкаНеРесурса\",\"Иерархия\"|}, ${4|\"Первая\",\"Последняя\",\"Предыдущая\",\"Следующая\",\"Текущая\",\"ОграничивающееЗначение\"|}, ${5|\"Первая\",\"Последняя\",\"Предыдущая\",\"Следующая\",\"Текущая\",\"ОграничивающееЗначение\"|}, \"$6\", ${7|\"Вместе\",\"Отдельно\"|})",
    "description": "ВычислитьВыражение"
  },
  "ДобавитьКДате": {
    "prefix": "ДобавитьКДате",
    "body": "ДобавитьКДате(\"$1\", ${2|\"Минута\",\"Час\",\"День\",\"Неделя\",\"Декада\",\"Месяц\",\"Квартал\",\"Полугодие\",\"Год\"|}, \"$3\")",
    "description": "ДобавитьКДате"
  },
  "РазностьДат": {
    "prefix": "РазностьДат",
    "body": "РазностьДат(\"$1\", \"$2\", ${3|\"Минута\",\"Час\",\"День\",\"Месяц\",\"Квартал\",\"Год\"|})",
    "description": "РазностьДат"
  }
}

export default DCSSnippets;