let querySnippets = {
  "Выбор": {
    "prefix": "Выбор",
    "body": "ВЫБОР\n\tКОГДА ${1:Условие}\n\t\tТОГДА $2\n\tИНАЧЕ $0\nКОНЕЦ",
    "description": "ВЫБОР"
  },
  "Запрос": {
    "prefix": "Запрос",
    "body": "ВЫБРАТЬ\n\t*\nИЗ\n\t${1:Источник} КАК ${0:Псевдоним}",
    "description": "Создание нового запроса"
  },
  "Левое": {
    "prefix": "Левое",
    "body": "ЛЕВОЕ СОЕДИНЕНИЕ ${1:Источник} КАК ${2:Псевдоним}\nПО ${3:Условие} = ${0:Условие}",
    "description": "Левое соединение"
  },
  "Правое": {
    "prefix": "Правое",
    "body": "ПРАВОЕ СОЕДИНЕНИЕ ${1:Источник} КАК ${2:Псевдоним}\nПО ${3:Условие} = ${0:Условие}",
    "description": "Правое соединение"
  },
  "Полное": {
    "prefix": "Полное",
    "body": "ПОЛНОЕ СОЕДИНЕНИЕ ${1:Источник} КАК ${2:Псевдоним}\nПО ${3:Условие} = ${0:Условие}",
    "description": "Полное соединение"
  },
  "Внутреннее": {
    "prefix": "Внутреннее",
    "body": "ВНУТРЕННЕЕ СОЕДИНЕНИЕ ${1:Источник} КАК ${2:Псевдоним}\nПО ${3:Условие} = ${0:Условие}",
    "description": "Внутреннее соединение"
  },
  "Разделитель": {
    "prefix": "Разделитель",
    "body": ";\n\n////////////////////////////////////////////////////////////////////////////////",
    "description": "Разделитель запросов"
  },
  "Выразить": {
    "prefix": "Выразить",
    "body": "ВЫРАЗИТЬ(${1:Источник} КАК ${2:Тип})$0",
    "description": "Приведение значение к определенному типу"
  },
}

export default querySnippets;